In [3]:
import pandas as pd
import numpy as np

In [4]:
url = "https://raw.githubusercontent.com/FazlyRabbiBD/Data-Science-Book/refs/heads/master/data-income-age-group.csv"

In [5]:
df = pd.read_csv(url)

In [6]:
df.head()

      Name  Age  Income($)
0      Rob   27      70000
1  Michael   29      90000
2    Mohan   29      61000
3   Ismail   28      60000
4     Kory   42     150000

In [7]:
df.rename(columns={'Income($)': 'income'}, inplace=True)

In [8]:
df.head()

      Name  Age  income
0      Rob   27   70000
1  Michael   29   90000
2    Mohan   29   61000
3   Ismail   28   60000
4     Kory   42  150000

In [13]:
summary_stats = df.groupby('Age')['income'].describe()
summary_stats

,count,mean,std,min,25%,50%,75%,max
Age,,,,,,,,
26,1.0,45000.000000,NaN,45000.0,45000.0,45000.0,45000.0,45000.0
27,2.0,59000.000000,15556.349186,48000.0,53500.0,59000.0,64500.0,70000.0
28,2.0,55500.000000,6363.961031,51000.0,53250.0,55500.0,57750.0,60000.0
29,3.0,66833.333333,20870.633276,49500.0,55250.0,61000.0,75500.0,90000.0
32,1.0,53000.000000,NaN,53000.0,53000.0,53000.0,53000.0,53000.0
35,1.0,130000.000000,NaN,130000.0,130000.0,130000.0,130000.0,130000.0
36,1.0,156000.000000,NaN,156000.0,156000.0,156000.0,156000.0,156000.0
37,1.0,137000.000000,NaN,137000.0,137000.0,137000.0,137000.0,137000.0
38,1.0,162000.000000,NaN,162000.0,162000.0,162000.0,162000.0,162000.0
39,3.0,97666.666667,50856.005873,58000.0,69000.0,80000.0,117500.0,155000.0
40,1.0,65000.000000,NaN,65000.0,65000.0,65000.0,65000.0,65000.0
41,3.0,101666.666667,51403.631519,63000.0,72500.0,82000.0,121000.0,160000.0
42,1.0,150000.000000,NaN,150000.0,150000.0,150000.0,150000.0,150000.0
43,1.0,64000.000000,NaN,64000.0,64000.0,64000.0,64000.0,64000.0

In [17]:
mean = df.groupby('Age')['income'].mean()
mean

Age
26     45000.000000
27     59000.000000
28     55500.000000
29     66833.333333
32     53000.000000
35    130000.000000
36    156000.000000
37    137000.000000
38    162000.000000
39     97666.666667
40     65000.000000
41    101666.666667
42    150000.000000
43     64000.000000
Name: income, dtype: float64

In [21]:
median = df.groupby('Age')['income'].median()
median

Age
26     45000.0
27     59000.0
28     55500.0
29     61000.0
32     53000.0
35    130000.0
36    156000.0
37    137000.0
38    162000.0
39     80000.0
40     65000.0
41     82000.0
42    150000.0
43     64000.0
Name: income, dtype: float64

In [25]:
min = df.groupby('Age')['income'].min()
min

Age
26     45000
27     48000
28     51000
29     49500
32     53000
35    130000
36    156000
37    137000
38    162000
39     58000
40     65000
41     63000
42    150000
43     64000
Name: income, dtype: int64

In [29]:
max = df.groupby('Age')['income'].max()
max

Age
26     45000
27     70000
28     60000
29     90000
32     53000
35    130000
36    156000
37    137000
38    162000
39    155000
40     65000
41    160000
42    150000
43     64000
Name: income, dtype: int64

In [31]:
std = df.groupby('Age')['income'].std()
std

Age
26             NaN
27    15556.349186
28     6363.961031
29    20870.633276
32             NaN
35             NaN
36             NaN
37             NaN
38             NaN
39    50856.005873
40             NaN
41    51403.631519
42             NaN
43             NaN
Name: income, dtype: float64

In [35]:
income_by_age = df.groupby('Age')['income'].apply(list)
income_by_age

Age
26                   [45000]
27            [70000, 48000]
28            [60000, 51000]
29     [90000, 61000, 49500]
32                   [53000]
35                  [130000]
36                  [156000]
37                  [137000]
38                  [162000]
39    [155000, 80000, 58000]
40                   [65000]
41    [160000, 63000, 82000]
42                  [150000]
43                   [64000]
Name: income, dtype: object